In [41]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.metrics import r2_score,mean_squared_error
from math import sqrt
%matplotlib inline
import seaborn as sns
sns.set(style='white',color_codes=True)
sns.set(font_scale=1.5)
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report,confusion_matrix,accuracy_score,precision_score,recall_score,f1_score

In [42]:
df_train =pd.read_csv('E:/project/train.csv')

In [43]:
df_train.shape

(891, 12)

In [44]:
df_train.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [45]:
df_train.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [46]:
df_train.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [47]:
df_train.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [48]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [49]:
df_train=df_train.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [50]:
df_train

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [51]:
def age_approx(cols):
    Age=cols[0]
    Pclass=cols[1]
    if pd.isnull(Age):
        if Pclass==1:
            return 37
        elif Pclass==2:
            return 29
        else:
            return 24
    else:
        return Age

In [52]:
df_train.groupby(['Pclass']).mean()

        Survived        Age     SibSp     Parch       Fare
Pclass
1       0.629630  38.233441  0.416667  0.356481  84.154687
2       0.472826  29.877630  0.402174  0.380435  20.662183
3       0.242363  25.140620  0.615071  0.393075  13.675550

In [53]:
df_train['Age']= df_train[['Age','Pclass']].apply(age_approx,axis=1)

In [54]:
df_train.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
dtype: int64

In [55]:
dummy1=pd.get_dummies(df_train['Sex'])

In [56]:
dummy2=pd.get_dummies(df_train['Embarked'])

In [57]:
df_train=pd.concat([df_train,dummy1,dummy2],axis=1)
df_train

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,female,male,C,Q,S
0,0,3,male,22.0,1,0,7.2500,S,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,1,0,1,0,0
2,1,3,female,26.0,0,0,7.9250,S,1,0,0,0,1
3,1,1,female,35.0,1,0,53.1000,S,1,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,S,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,0,1,0,0,1
887,1,1,female,19.0,0,0,30.0000,S,1,0,0,0,1
888,0,3,female,24.0,1,2,23.4500,S,1,0,0,0,1
889,1,1,male,26.0,0,0,30.0000,C,0,1,1,0,0
890,0,3,male,32.0,0,0,7.7500,Q,0,1,0,1,0

In [58]:
df_train=df_train.drop(['Sex','Embarked'],axis=1)

In [60]:
df_train

     Survived  Pclass   Age  SibSp  Parch     Fare  female  male  C  Q  S
0           0       3  22.0      1      0   7.2500       0     1  0  0  1
1           1       1  38.0      1      0  71.2833       1     0  1  0  0
2           1       3  26.0      0      0   7.9250       1     0  0  0  1
3           1       1  35.0      1      0  53.1000       1     0  0  0  1
4           0       3  35.0      0      0   8.0500       0     1  0  0  1
..        ...     ...   ...    ...    ...      ...     ...   ... .. .. ..
886         0       2  27.0      0      0  13.0000       0     1  0  0  1
887         1       1  19.0      0      0  30.0000       1     0  0  0  1
888         0       3  24.0      1      2  23.4500       1     0  0  0  1
889         1       1  26.0      0      0  30.0000       0     1  1  0  0
890         0       3  32.0      0      0   7.7500       0     1  0  1  0

[891 rows x 11 columns]

In [61]:
x=df_train.drop(['Survived'],axis=1)

In [63]:
y=df_train.Survived

In [64]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.1,random_state=42)

In [65]:
logreg=LogisticRegression()
logreg.fit(x_train,y_train)

C:\Users\ASUS\.conda\envs\py3-TF2.0\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [66]:
logreg.score(x_test,y_test)

0.8444444444444444

In [67]:
y_pred=logreg.predict(x_test)

In [68]:
print (classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.88      0.85      0.87        54
           1       0.79      0.83      0.81        36

    accuracy                           0.84        90
   macro avg       0.84      0.84      0.84        90
weighted avg       0.85      0.84      0.85        90

In [69]:
confusion_matrix(y_pred,y_test)

array([[46,  6],
       [ 8, 30]], dtype=int64)

In [70]:
accuracy_score(y_test,y_pred)

0.8444444444444444

In [71]:
logreg.coef_

array([[-1.00952067, -0.03173122, -0.32414676, -0.07820017,  0.00217896,
         2.13412169, -0.46919291,  0.76788445,  0.49416927,  0.31129458]])

In [72]:
logreg.intercept_

array([1.91745053])